let number = 5; // let означает то что наша переменная изменяемая
const leftBorderWidth = 1; //const константа не меняется, хорошим тоном в JS является использование const где это только возможно
// + есть одна особенность: прямых констант в JS не бывает т.к мы можем создать объект и добавить свойство коротое можно изменить
// прямых констант в JS не бывает
const obj = {
    a: 50
};
obj.a = 10;
console.log(obj);


var name = 'Inna'; // 3й устаревший вариант задание перемноой, её проблема состоит в том что она существует до того как она была объявлена в коде

